import React, { useEffect, useState } from 'react';
import { IonContent, IonList, IonPage } from '@ionic/react';
import { useParams } from 'react-router';
import Header from '../components/Header';

type DevotionalDetails = {
  [key: string]: string;
};

const Details: React.FC = () => {
  const { devotionalName } = useParams<{ devotionalName: string }>();
  const [mantra, setMantra] = useState<string | null>(null);
  
  useEffect(() => {
    const devotionalDetailsData: DevotionalDetails = {
      'Hanuman Chalisa': `\
        श्री हनुमान चालीसा

        दोहा
        श्रीगुरु चरन सरोज रज, निज मनु मुकुरु सुधारि।
        बरनऊं रघुबर बिमल जसु, जो दायकु फल चारि।।
    
        बुद्धिहीन तनु जानिके, सुमिरौं पवन-कुमार।
        बल बुधि विद्या देहु मोहिं, हरहु कलेस विकार।।

        ------------------------------------------------------------
    
        जय हनुमान ज्ञान गुन सागर ।
        जय कपीस तिहुँ लोक उजागर ।। १ ।।

        राम दूत अतुलित बल धामा ।
        अंजनि-पुत्र पवनसुत नामा ।। २ ।।
        
        महाबीर बिक्रम बजरंगी ।
        कुमति निवार सुमति के संगी ।। ३ ।।
        
        कंचन बरन बिराज सुबेसा ।
        कानन कुंडल कुंचति केसा ।। ४ ।।
        
        हाथ बज्र औ ध्वजा बिराजै ।
        काँधे मूँज जनेऊ साजै ।। ५ ।।
        
        संकर सुवन केसरीनंदन ।
        तेज प्रताप महा जग बंदन ।। ६ ।।
        
        बिद्यावान गुनी अति चातुर ।
        राम काज करिबे को आतुर ।। ७ ।।
        
        प्रभु चरित्र सुनिबे को रसिया ।
        राम लखन सीता मन बसिया ।। ८ ।।
        
        सूक्ष्म रूप धरि सियहिं दिखावा ।
        बिकट रूप धरि लंक जरावा ।। ९ ।।
        
        भीम रूप धरि असुर सँहारे ।
        रामचंद्र के काज सँवारे ।। १० ।।
        
        लाय सजीवन लखन जियाये ।
        श्रीरघुबीर हरषि उर लाये ।। ११ ।।
        
        रघुपति कीन्ही बहुत बडाई ।
        तुम मम प्रिय भरतहि सम भाई ।। १२ ।।
        
        सहस बदन तुम्हरो जस गावैं ।
        अस कहि श्रीपति कंठ लगावैं ।। १३ ।।
        
        सनकादिक ब्रह्मादि मुनीसा ।
        नारद सारद सहित अहीसा ।। १४ ।।
        
        जम कुबेर दिगपाल जहाँ ते ।
        कबि कोबिद कहि सके कहाँ ते ।। १५ ।।
        
        तुम उपकार सुग्रीवहिं कीन्हा ।
        राम मिलाय राज पद दीन्हा ।। १६ ।।
        
        तुम्हरो मन्त्र बिभीषन माना ।
        लंकेस्वर भए सब जग जाना ।। १७ ।।
        
        जुग सहस्र जोजन पर भानू ।
        लील्यो ताहि मधुर फल जानू ।। १८ ।।
        
        प्रभु मुद्रिका मेलि मुख माहीं ।
        जलधि लांघि गये अचरज नाहीं ।। १९ ।।
        
        दुर्गम काज जगत के जेते ।
        सुगम अनुग्रह तुम्हरे तेते ।। २० ।।
        
        राम दुआरे तुम रखवारे ।
        होत न आज्ञा बिनु पैसारे ।। २१ ।।
        
        सब सुख लहै तुम्हारी सरना ।
        तुम रच्छक काहू को डर ना ।। २२ ।।
        
        आपन तेज सम्हारो आपै ।
        तीनों लोक हाँक ते काँपै ।। २३ ।।
        
        भूत पिसाच निकट नहिं आवै ।
        महाबीर जब नाम सुनावै ।। २४ ।।
        
        नासै रोग हरै सब पीरा ।
        जपत निरंतर हनुमत बीरा ।। २५ ।।
        
        संकट तें हनुमान छुडावै ।
        मन क्रम बचन ध्यान जो लावै ।। २६ ।।
        
        सब पर राम तपस्वी राजा ।
        तिन के काज सकल तुम साजा ।। २७ ।।
        
        और मनोरथ जो कोइ लावै ।
        सोइ अमित जीवन फल पावै ।। २८ ।।
        
        चारों जुग परताप तुम्हारा ।
        है परसिद्ध जगत उजियारा ।। २९ ।।
        
        साधु संत के तुम रखवारे ।
        असुर निकंदन राम दुलारे ।। ३० ।।
        
        अष्ट सिद्धि नौ निधि के दाता ।
        अस बर दीन जानकी माता ।। ३१ ।।
        
        राम रसायन तुम्हरे पासा ।
        सदा रहो रघुपति के दासा ।। ३२ ।।
        
        तुम्हरे भजन राम को पावै ।
        जनम जनम के दुख बिसरावै ।। ३३ ।।
        
        अंत काल रघुबर पुर जाई ।
        जहाँ जन्म हरि-भक्त कहाई ।। ३४ ।।
        
        और देवता चित्त न धरई ।
        हनुमत सेइ सर्ब सुख करई ।। ३५ ।।
        
        संकट कटै मिटै सब पीरा ।
        जो सुमिरै हनुमत बलबीरा ।। ३६ ।।
        
        जै जै जै हनुमान गोसाई ।
        कृपा करहु गुरु देव की नाई ।। ३७ ।।
        
        जो सत बार पाठ कर कोई ।
        छूटहि बंदि महा सुख होई ।। ३८ ।।
        
        जो यह पढै हनुमानचालीसा ।
        होय सिद्धि साखी गौरीसा ।। ३९ ।।
        
        तुलसीदास सदा हरि चेरा ।
        कीजै नाथ हृदय महँ डेरा ।। ४० ।।
        
        ------------------------------------------------------------
        दोहा
    
        पवन तनय संकट हरण, मंगल मूरति रूप।
        राम लखन सीता सहित, हृदय बसहुरूप।।
      `,
      'Gayatri Mantra': `\
        गायत्री मंत्र
        
        ॐ भूर् भुवः स्वः |
        तत् सवितुर्वरेण्यं  |
        भर्गो देवस्य धीमहि |
        धियो यो नः प्रचोदयात् ||
      `,
      'Shri Ramrksha stotra': `\
        श्री रामरक्षा स्त्रोत्र
        
        विनियोग:
        -------------------------------------------------------------
        अस्य श्रीरामरक्षास्त्रोतमन्त्रस्य बुधकौशिक ऋषिः ।
        श्री सीतारामचंद्रो देवता ।
        अनुष्टुप छंदः। सीता शक्तिः ।
        श्रीमान हनुमान कीलकम ।
        श्री सीतारामचंद्रप्रीत्यर्थे रामरक्षास्त्रोतजपे विनियोगः ।

        अथ ध्यानम्‌:
        -------------------------------------------------------------
        ध्यायेदाजानुबाहुं धृतशरधनुषं बद्धपदमासनस्थं,
        पीतं वासो वसानं नवकमल दल स्पर्धिनेत्रम् प्रसन्नम ।
        वामांकारूढ़ सीता मुखकमलमिलल्लोचनम्नी,
        रदाभम् नानालंकारदीप्तं दधतमुरुजटामण्डलम् रामचंद्रम ॥
        -------------------------------------------------------------

        राम रक्षा स्तोत्रम्:
        -------------------------------------------------------------
        चरितं रघुनाथस्य शतकोटि प्रविस्तरम् ।
        एकैकमक्षरं पुंसां महापातकनाशनम् ॥1॥

        ध्यात्वा नीलोत्पलश्यामं रामं राजीवलोचनम् ।
        जानकीलक्ष्मणोपेतं जटामुकुटमण्डितं ॥2॥

        सासितूणधनुर्बाणपाणिं नक्तंचरान्तकम् ।
        स्वलीलया जगत्त्रातुमाविर्भूतमजं विभुम् ॥3॥

        रामरक्षां पठेत प्राज्ञः पापघ्नीं सर्वकामदाम् ।
        शिरो मे राघवः पातु भालं दशरथात्मजः ॥4॥

        कौसल्येयो दृशो पातु विश्वामित्रप्रियः श्रुति ।
        घ्राणं पातु मखत्राता मुखं सौमित्रिवत्सलः ॥5॥

        जिह्वां विद्यानिधिः पातु कण्ठं भरतवन्दितः ।
        स्कन्धौ दिव्यायुधः पातु भुजौ भग्नेशकार्मुकः ॥6॥

        करौ सीतापतिः पातु हृदयं जामदग्न्यजित ।
        मध्यं पातु खरध्वंसी नाभिं जाम्बवदाश्रयः ॥7॥

        सुग्रीवेशः कटी पातु सक्थिनी हनुमत्प्रभुः ।
        उरु रघूत्तमः पातु रक्षःकुलविनाशकृताः ॥8॥

        जानुनी सेतुकृत पातु जंघे दशमुखांतकः ।
        पादौ विभीषणश्रीदः पातु रामअखिलं वपुः ॥9॥

        एतां रामबलोपेतां रक्षां यः सुकृति पठेत ।
        स चिरायुः सुखी पुत्री विजयी विनयी भवेत् ॥10॥

        पातालभूतल व्योम चारिणश्छद्मचारिणः ।
        न द्रष्टुमपि शक्तास्ते रक्षितं रामनामभिः ॥11॥

        रामेति रामभद्रेति रामचंद्रेति वा स्मरन ।
        नरौ न लिप्यते पापैर्भुक्तिं मुक्तिं च विन्दति ॥12॥

        जगज्जैत्रैकमन्त्रेण रामनाम्नाभिरक्षितम् ।
        यः कण्ठे धारयेत्तस्य करस्थाः सर्वसिद्धयः ॥13॥

        वज्रपञ्जरनामेदं यो रामकवचं स्मरेत ।
        अव्याहताज्ञाः सर्वत्र लभते जयमंगलम् ॥14॥

        आदिष्टवान् यथा स्वप्ने रामरक्षामिमां हरः ।
        तथा लिखितवान् प्रातः प्रबुद्धो बुधकौशिकः ॥15॥

        आरामः कल्पवृक्षाणां विरामः सकलापदाम् ।
        अभिरामस्त्रिलोकानां रामः श्रीमान स नः प्रभुः ॥16॥

        तरुणौ रूपसम्पन्नौ सुकुमारौ महाबलौ ।
        पुण्डरीकविशालाक्षौ चीरकृष्णाजिनाम्बरौ ॥17॥

        फलमूलाशिनौ दान्तौ तापसौ ब्रह्मचारिणौ ।
        पुत्रौ दशरथस्यैतौ भ्रातरौ रामलक्ष्मणौ ॥18॥

        शरण्यौ सर्वसत्वानां श्रेष्ठौ सर्वधनुष्मताम् ।
        रक्षःकुलनिहन्तारौ त्रायेतां नो रघूत्तमौ ॥19॥

        आत्तसज्जधनुषाविषुस्पृशा वक्ष याशुगनिषङ्गसङ्गिनौ ।
        रक्षणाय मम रामलक्ष्मणावग्रतः पथि सदैव गच्छताम ॥20॥

        सन्नद्धः कवची खड्गी चापबाणधरो युवा ।
        गच्छन् मनोरथान नश्च रामः पातु सलक्ष्मणः ॥21॥

        रामो दाशरथी शूरो लक्ष्मणानुचरो बली ।
        काकुत्स्थः पुरुषः पूर्णः कौसल्येयो रघूत्तमः ॥22॥

        वेदान्तवेद्यो यज्ञेशः पुराणपुरुषोत्तमः ।
        जानकीवल्लभः श्रीमानप्रमेयपराक्रमः ॥23॥

        इत्येतानि जपन नित्यं मद्भक्तः श्रद्धयान्वितः ।
        अश्वमेधाधिकं पुण्यं सम्प्राप्नोति न संशयः ॥24॥

        रामं दुर्वादलश्यामं पद्माक्षं पीतवाससम ।
        स्तुवन्ति नामभिर्दिव्यैर्न ते संसारिणो नरः ॥25॥

        रामं लक्ष्मणपूर्वजं रघुवरं सीतापतिं सुन्दरं,
        काकुत्स्थं करुणार्णवं गुणनिधिं विप्रप्रियं धार्मिकम ।
        राजेन्द्रं सत्यसंधं दशरथतनयं श्यामलं शांतमूर्तिं,
        वन्दे लोकाभिरामं रघुकुलतिलकं राघवं रावणारिम ॥26॥

        रामाय रामभद्राय रामचंद्राय वेधसे ।
        रघुनाथाय नाथाय सीतायाः पतये नमः ॥27॥

        श्रीराम राम रघुनन्दनराम राम,
        श्रीराम राम भरताग्रज राम राम ।
        श्रीराम राम रणकर्कश राम राम,
        श्रीराम राम शरणं भव राम राम ॥28॥

        श्रीराम चन्द्रचरणौ मनसा स्मरामि,
        श्रीराम चंद्रचरणौ वचसा गृणामि ।
        श्रीराम चन्द्रचरणौ शिरसा नमामि,
        श्रीराम चन्द्रचरणौ शरणं प्रपद्ये ॥29॥

        माता रामो मत्पिता रामचंन्द्र: ।
        स्वामी रामो मत्सखा रामचंद्र: ।
        सर्वस्वं मे रामचन्द्रो दयालु ।
        नान्यं जाने नैव जाने न जाने ॥

        दक्षिणे लक्ष्मणो यस्य वामे च जनकात्मज ।
        पुरतो मारुतिर्यस्य तं वन्दे रघुनन्दनम् ॥31॥

        लोकाभिरामं रणरंगधीरं राजीवनेत्रं रघुवंशनाथं ।
        कारुण्यरूपं करुणाकरं तं श्रीरामचन्द्रं शरणं प्रपद्ये ॥32॥

        मनोजवं मारुततुल्यवेगं जितेन्द्रियं बुद्धिमतां वरिष्ठम ।
        वातात्मजं वानरयूथमुख्यं श्रीराम दूतं शरणं प्रपद्ये ॥33॥

        कूजन्तं रामरामेति मधुरं मधुराक्षरम ।
        आरुह्य कविताशाखां वन्दे वाल्मीकिकोकिलम ॥34॥

        आपदामपहर्तारं दातारं सर्वसम्पदाम् ।
        लोकाभिरामं श्रीरामं भूयो भूयो नमाम्यहम् ॥35॥

        भर्जनं भवबीजानामर्जनं सुखसम्पदाम् ।
        तर्जनं यमदूतानां रामरामेति गर्जनम् ॥36॥

        रामो राजमणिः सदा विजयते,
        रामं रमेशं भजे रामेणाभिहता,
        निशाचरचमू रामाय तस्मै नमः ।
        रामान्नास्ति परायणं परतरं,
        रामस्य दासोस्म्यहं रामे चित्तलयः,
        सदा भवतु मे भो राम मामुद्धराः ॥37॥

        राम रामेति रामेति रमे रामे मनोरमे ।
        सहस्त्रनाम तत्तुल्यं रामनाम वरानने ॥38॥
      `,
      'Maruti stotra': `\
        मारुति स्रोत
        
        भीमरूपी महारुद्रा,
        वज्र हनुमान मारुती ।
        वनारी अंजनीसूता,
        रामदूता प्रभंजना ।।१।।

        महाबळी प्राणदाता,
        सकळां उठवीं बळें ।
        सौख्यकारी शोकहर्ता (१),
        धूर्त वैष्णव गायका ।।२।।

        दिनानाथा हरीरूपा,
        सुंदरा जगदंतरा ।
        पाताळदेवताहंता,
        भव्य सिंदूरलेपना ।।३।।

        लोकनाथा जगन्नाथा,
        प्राणनाथा पुरातना ।
        पुण्यवंता पुण्यशीला,
        पावना परतोषका ।।४।।

        ध्वजांगे उचली बाहू,
        आवेशें लोटिला पुढें ।
        काळाग्नी काळरुद्राग्नी,
        देखतां कांपती भयें ।।५।।

        ब्रह्मांड माईला (२) नेणों,
        आवळें दंतपंगती ।
        नेत्राग्नी चालिल्या ज्वाळा,
        भृकुटी त्राहिटिल्या बळें ।।६।।

        पुच्छ तें मुरडिलें माथां,
        किरीटी कुंडलें बरीं ।
        सुवर्णकटीकासोटी,
        घंटा किंकिणी नागरा ।।७।।

        ठकारे पर्वताऐसा,
        नेटका सडपातळू ।
        चपळांग पाहतां मोठें,
        महाविद्युल्लतेपरी ।।८।।

        कोटिच्या कोटि उड्डाणें,
        झेपावे उत्तरेकडे ।
        मंद्राद्रीसारिखा द्रोणू,
        क्रोधे उत्पाटिला बळें ।।९।।

        आणिता मागुता नेला,
        गेला आला मनोगती । (३)
        मनासी टाकिलें मागें,
        गतीस (४) तूळणा नसे ।।१०।।

        अणूपासोनि ब्रह्मांडा,
        येवढा होत जातसे ।
        तयासी तुळणा कोठें,
        मेरुमंदार धाकुटें ।।११।।

        ब्रह्मांडाभोंवते वेढे,
        वज्रपुच्छ घालूं (५) शके ।
        तयासि तूळणा कैचीं,
        ब्रह्मांडीं पाहतां नसे ।।१२।।

        आरक्त देखिलें डोळां,
        गिळीलें (६) सूर्यमंडळा ।
        वाढतां वाढतां वाढे,
        भेदिलें शून्यमंडळा ।।१३।।

        धनधान्यपशुवृद्धी,
        पुत्रपौत्र समग्रही ।
        पावती रूपविद्यादी,
        स्तोत्र पाठें करूनियां ।।१४।।

        भूतप्रेतसमंधादी,
        रोगव्याधी समस्तही ।
        नासती तूटती चिंता,
        आनंदें भीमदर्शनें ।।१५।।

        हे धरा पंधराश्लोकी,
        लाभली शोभली बरी।
        दृढदेहो निसंदेहो,
        संख्या चंद्रकळागुणें ।।१६।।

        रामदासी अग्रगण्यू,
        कपिकुळासी मंडण (७) ।
        रामरूपी अंतरात्मा,
        दर्शनें दोष नासती ।।१७।।

        ।। इति श्रीरामदासकृतं संकटनिरसनं
        मारुतिस्तोत्रं संपूर्णम् ।।
        ।। श्रीसीतारामचंद्रार्पणमस्तु ।।
      `,
      'Madhurashtakam': `\
        मधुराष्टकं
        
        अधरं मधुरं वदनं मधुरं नयनं मधुरं हसितं मधुरम् ।
        हृदयं मधुरं गमनं मधुरं मधुराधिपतेरखिलं मधुरम् ॥ १ ॥
        
        वचनं मधुरं चरितं मधुरं वसनं मधुरं वलितं मधुरम् ।
        चलितं मधुरं भ्रमितं मधुरं मधुराधिपतेरखिलं मधुरम् ॥ २ ॥
        
        वेणुर्मधुरो रेणुर्मधुरः पाणिर्मधुरः पादौ मधुरौ ।
        नृत्यं मधुरं सख्यं मधुरं मधुराधिपतेरखिलं मधुरम् ॥ ३ ॥
        
        गीतं मधुरं पीतं मधुरं भुक्तं मधुरं सुप्तं मधुरम् ।
        रूपं मधुरं तिलकं मधुरं मधुराधिपतेरखिलं मधुरम् ॥ ४ ॥

        करणं मधुरं तरणं मधुरं हरणं मधुरं स्मरणं मधुरम् ।
        वमितं मधुरं शमितं मधुरं मधुराधिपतेरखिलं मधुरम् ॥ ५ ॥

        गुञ्जा मधुरा माला मधुरा यमुना मधुरा वीची मधुरा ।
        सलिलं मधुरं कमलं मधुरं मधुराधिपतेरखिलं मधुरम् ॥ ६ ॥

        गोपी मधुरा लीला मधुरा युक्तं मधुरं मुक्तं मधुरम् ।
        दृष्टं मधुरं शिष्टं मधुरं मधुराधिपतेरखिलं मधुरम् ॥ ७ ॥

        गोपा मधुरा गावो मधुरा यष्टिर्मधुरा सृष्टिर्मधुरा ।
        दलितं मधुरं फलितं मधुरं मधुराधिपतेरखिलं मधुरम् ॥ ८ ॥
      `,
      'Shri Ram Stuti': `\
        श्री राम स्तुति
        
        श्री रामचन्द्र कृपालु भजुमन हरणभवभयदारुणं
        नवकंज लोचन कंज मुखकर, कंज पद कन्जारुणम्
        कन्दर्प अगणित अमित छवि नवनील नीरद सुन्दरं
        पटपीत मानहु तडित रूचिशुचि नौमिजनकसुतावरं
        भजुदीनबन्धु दिनेश दानव दैत्यवंशनिकन्दनं
        रघुनन्द आनन्दकन्द कोशलचन्द्र दशरथनन्दनं
        सिरमुकुटकुण्डल तिलकचारू उदारु अंगविभूषणं
        आजानुभुज शरचापधर संग्रामजित खरदूषणं
        इति वदति तुलसीदास शङकरशेषमुनिमनरंजनं
        ममहृदयकंजनिवासकुरु कामादि खलदल गञजनं
        मनु जाहि राचेउ मिलिहि सो बरु सहज सुन्दर सावरो
        करुना निधान सुजान सीलु सनेहु जानत रावरो
        एही भाँति गौरी असीस सुनी सिय सहित हिय हरषींअली
        तुलसी भवानी पूजी पुनि-पुनि मुदित मन मन्दिर चली
        मुदित मन मंदिर चली
        
        ------------------------------------------------------------
        सोरठा

        जानी गौरी अनुकूल सिय हिय हरषु न जाइ कहि
        मंजुल मंगल मूल बाम अंग फरकन लगे
      `,
      'Bajrang Baan': `\
        बजरंग बाण
        
        दोहा
        "निश्चय प्रेम प्रतीति ते, बिनय करैं सनमान।"
        "तेहि के कारज सकल शुभ, सिद्ध करैं हनुमान॥"

        ----------------------------------------------------------
        
        चोपाई

        जय हनुमन्त सन्त हितकारी। सुन लीजै प्रभु अरज हमारी।।
        जन के काज विलम्ब न कीजै। आतुर दौरि महासुख दीजै।।
        जैसे कूदि सिन्धु महि पारा। सुरसा बदन पैठि विस्तारा।।
        आगे जाई लंकिनी रोका। मारेहु लात गई सुर लोका।।
        जाय विभीषण को सुख दीन्हा। सीता निरखि परमपद लीन्हा।।
        बाग उजारि सिन्धु महँ बोरा। अति आतुर जमकातर तोरा।।
        अक्षयकुमार को मारि संहारा। लूम लपेट लंक को जारा।।
        लाह समान लंक जरि गई। जय जय धुनि सुरपुर में भई।।
        अब विलम्ब केहि कारण स्वामी। कृपा करहु उर अन्तर्यामी।।
        जय जय लक्ष्मण प्राण के दाता। आतुर होय दुख हरहु निपाता।।
        जै गिरिधर जै जै सुखसागर। सुर समूह समरथ भटनागर।।
        ॐ हनु हनु हनुमंत हठीले। बैरिहिं मारु बज्र की कीले।।
        गदा बज्र लै बैरिहिं मारो। महाराज प्रभु दास उबारो।।
        ऊँकार हुंकार प्रभु धावो। बज्र गदा हनु विलम्ब न लावो।।
        ॐ ह्रीं ह्रीं ह्रीं हनुमंत कपीसा। ऊँ हुं हुं हुं हनु अरि उर शीशा।।
        सत्य होहु हरि शपथ पाय के। रामदूत धरु मारु जाय के।।
        जय जय जय हनुमन्त अगाधा। दुःख पावत जन केहि अपराधा।।
        पूजा जप तप नेम अचारा। नहिं जानत हौं दास तुम्हारा।।
        वन उपवन, मग गिरिगृह माहीं। तुम्हरे बल हम डरपत नाहीं।।
        पांय परों कर ज़ोरि मनावौं। यहि अवसर अब केहि गोहरावौं।।
        जय अंजनिकुमार बलवन्ता। शंकरसुवन वीर हनुमन्ता।।
        बदन कराल काल कुल घालक। राम सहाय सदा प्रतिपालक।।
        भूत प्रेत पिशाच निशाचर। अग्नि बेताल काल मारी मर।।
        इन्हें मारु तोहिं शपथ राम की। राखु नाथ मरजाद नाम की।।
        जनकसुता हरिदास कहावौ। ताकी शपथ विलम्ब न लावो।।
        जय जय जय धुनि होत अकाशा। सुमिरत होत दुसह दुःख नाशा।।
        चरण शरण कर ज़ोरि मनावौ। यहि अवसर अब केहि गोहरावौं।।
        उठु उठु चलु तोहि राम दुहाई। पांय परों कर ज़ोरि मनाई।।
        ॐ चं चं चं चं चपत चलंता। ऊँ हनु हनु हनु हनु हनुमन्ता।।
        ऊँ हँ हँ हांक देत कपि चंचल। ऊँ सं सं सहमि पराने खल दल।।
        अपने जन को तुरत उबारो। सुमिरत होय आनन्द हमारो।।
        यह बजरंग बाण जेहि मारै। ताहि कहो फिर कौन उबारै।।
        पाठ करै बजरंग बाण की। हनुमत रक्षा करै प्राण की।।
        यह बजरंग बाण जो जापै। ताते भूत प्रेत सब काँपै।।
        धूप देय अरु जपै हमेशा। ताके तन नहिं रहै कलेशा।।

        ----------------------------------------------

        दोहा

        " प्रेम प्रतीतहि कपि भजै, सदा धरैं उर ध्यान। "
        " तेहि के कारज सकल शुभ, सिद्घ करैं हनुमान।। "
      `,
      'Hanuman Ji Aarti': `\
        हनुमान जी आरती
        
        आरती कीजै हनुमान लला की
        आरती कीजै हनुमान लला की
        दुष्ट डलन रघुनाथ कला की
        (आरती कीजै हनुमान लला की)
        (आरती कीजै हनुमान लला की)
        जाके बल से गिरिवर कांपे
        रोग दोष जाके निकट न झांपे
        अनजनी पुत्र महाबलदायी
        संथन के प्रभु सदा सुहाई
        (आरती कीजै हनुमान लला की)
        (आरती कीजै हनुमान लला की)
        दे बीरा रघुनाथ पठाए
        लंका जारी सिया सुध लाए
        (लंका सो कोट समुद्र सी खाई)
        (जात पवनसुत बार न लाई)
        लंका जारी असुरसंगारे
        सियारामजी के काज संवारे
        लक्ष्मण मूर्छित पड़े सकारे
        आणि सजीवन प्राण उबारे
        (पैठी पताल तोरि जम कारे)
        (अहिरावण की भुजा उखाड़े)
        बाएं भुजा असुरदल मारे
        दाहिने भुजा संतजन तारे
        सुर-नर-मुनि आरती उतारे
        जै जै जै हनुमान उचारे
        जो हनुमान की आरती गावै
        बसी बैकुंठ परमपद पावै
        (आरती कीजै हनुमान लला की)
        (आरती कीजै हनुमान लला की)
        (आरती कीजै हनुमान लला की)
        (आरती कीजै हनुमान लला की)
      `,
      'Sankat Mochan Hanumanashtak': `\
        संकट मोचन हनुमानाष्टक
        
        बाल समय रवि भक्षी लियो तब
        तीनहुं लोक भयो अंधियारों
        ताहि सों त्रास भयो जग को
        यह संकट काहु सों जात न टारो
        (देवन आनि करी बिनती तब)
        (छाड़ी दियो रवि कष्ट निवारो)
        को नहीं जानत है जग में कपि
        (संकटमोचन नाम तिहारो, संकटमोचन नाम तिहारो)
        बालि की त्रास कपीस बसैं गिरि
        जात महाप्रभु पंथ निहारो
        चौंकि महामुनि साप दियो तब
        चाहिए कौन बिचार बिचारो
        (कैद्विज रूप लिवाय महाप्रभु)
        (सो तुम दास के सोक निवारो)
        को नहीं जानत है जग में कपि
        (संकटमोचन नाम तिहारो, संकटमोचन नाम तिहारो)
        अंगद के संग लेन गए सिय
        खोज कपीस यह बैन उचारो
        जीवत न बचिहौ हम सो जु
        बिना सुधि लाये इहाँ पगु धारो
        (हेरी थके तट सिन्धु सबे तब)
        (लाए सिया-सुधि प्राण उबारो)
        को नहीं जानत है जग में कपि
        (संकटमोचन नाम तिहारो, संकटमोचन नाम तिहारो)
        रावण त्रास दई सिय को सब
        राक्षसी सों कही सोक निवारो
        ताहि समय हनुमान महाप्रभु
        जाए महा रजनीचर मारो
        (चाहत सीय असोक सों आगि सु)
        (दै प्रभुमुद्रिका सोक निवारो)
        को नहीं जानत है जग में कपि
        (संकटमोचन नाम तिहारो, संकटमोचन नाम तिहारो)
        बान लग्यो उर लछिमन के तब
        प्राण तजे सुत रावण मारो
        लै गृह बैद्य सुषेन समेत
        तबै गिरि द्रोण सुबीर उपारो
        (आनि सजीवन हाथ दई तब)
        (लछिमन के तुम प्रान उबारो)
        को नहीं जानत है जग में कपि
        (संकटमोचन नाम तिहारो, संकटमोचन नाम तिहारो)
        रावन युद्ध अजान कियो तब
        नाग कि फांस सबै सिर डारो
        श्री रघुनाथ समेत सबै दल
        मोह भयो यह संकट भारो
        (आनि खगेस तबै हनुमान जु)
        (बंधन काटि सुत्रास निवारो)
        को नहीं जानत है जग में कपि
        (संकटमोचन नाम तिहारो, संकटमोचन नाम तिहारो)
        बंधु समेत जबै अहिरावन
        लै रघुनाथ पताल सिधारो
        देबिन्हीं पूजि भली विधि सों बलि
        देउ सबै मिलि मन्त्र विचारो
        (जाये सहाए भयो तब ही)
        (अहिरावन सैन्य समेत संहारो)
        को नहीं जानत है जग में कपि
        (संकटमोचन नाम तिहारो, संकटमोचन नाम तिहारो)
        काज किये बड़ देवन के तुम
        बीर महाप्रभु देखि बिचारो
        कौन सो संकट मोर गरीब को
        जो तुमसो नहिं जात है टारो
        (बेगि हरो हनुमान महाप्रभु)
        (जो कछु संकट होए हमारो)
        को नहीं जानत है जग में कपि
        (संकटमोचन नाम तिहारो, संकटमोचन नाम तिहारो)
        (संकटमोचन नाम तिहारो, संकटमोचन नाम तिहारो)
      `,
      'Shri Ganpati Atharvashirsha': `\
        श्री गणपति अथर्वशीर्ष
        
        ॐ नमस्ते गणपतये :

        ॐ भद्रं कर्णेभिः शृणुयाम देवाः ।
        भद्रं पश्येमाक्षभिर्यजत्राः ।
        स्थिरैरङ्गैस्तुष्टुवाग्‍ँसस्तनूभिः ।
        व्यशेम देवहितं यदायूः ।

        स्वस्ति न इन्द्रो वृद्धश्रवाः ।
        स्वस्ति नः पूषा विश्ववेदाः ।
        स्वस्ति नस्तार्क्ष्यो अरिष्टनेमिः ।
        स्वस्ति नो बृहस्पतिर्दधातु ॥
        ॐ शान्तिः शान्तिः शान्तिः ॥

        ॐ नमस्ते गणपतये ॥१॥

        त्वमेव प्रत्यक्षं तत्त्वमसि ।
        त्वमेव केवलं कर्ताऽसि ।
        त्वमेव केवलं धर्ताऽसि ।
        त्वमेव केवलं हर्ताऽसि ।
        त्वमेव सर्वं खल्विदं ब्रह्मासि ।
        त्वं साक्षादात्माऽसि नित्यम् ॥२॥

        ऋतं वच्मि । सत्यं वच्मि ॥३॥

        अव त्वं माम् ।
        अव वक्तारम् ।
        अव श्रोतारम् ।
        अव दातारम् ।
        अव धातारम् ।
        अवानूचानमव शिष्यम् ।

        अव पुरस्तात् ।
        अव दक्षिणात्तात् ।
        अव पश्चात्तात् ।
        अवोत्तरात्तात् ।
        अव चोर्ध्वात्तात् ।
        अवाधरात्तात् ।
        सर्वतो मां पाहि पाहि समन्तात् ॥४॥

        त्वं वाङ्मयस्त्वं चिन्मयः ।
        त्वमानन्दमयस्त्वं ब्रह्ममयः ।
        त्वं सच्चिदानन्दाऽद्वितीयोऽसि ।
        त्वं प्रत्यक्षं ब्रह्मासि ।
        त्वं ज्ञानमयो विज्ञानमयोऽसि ॥५॥

        सर्वं जगदिदं त्वत्तो जायते ।
        सर्वं जगदिदं त्वत्तस्तिष्ठति ।
        सर्वं जगदिदं त्वयि लयमेष्यति ।
        सर्वं जगदिदं त्वयि प्रत्येति ।

        त्वं भूमिरापोऽनलोऽनिलो नभः ।
        त्वं चत्वारि वाक् {परिमिता} पदानि ।

        त्वं गुणत्रयातीतः ।
        त्वं अवस्थात्रयातीतः ।
        त्वं देहत्रयातीतः ।
        त्वं कालत्रयातीतः ।

        त्वं मूलाधारस्थितोऽसि नित्यम् ।
        त्वं शक्तित्रयात्मकः ।
        त्वां योगिनो ध्यायन्ति नित्यम् ।

        त्वं ब्रह्मा त्वं विष्णुस्त्वं
        रुद्रस्त्वमिन्द्रस्त्वमग्निस्त्वं
        वायुस्त्वं सूर्यस्त्वं चन्द्रमास्त्वं
        ब्रह्म भूर्भुवस्सुवरोम् ॥६॥

        गणादिं पूर्वमुच्चार्य वर्णादींस्तदनन्तरम् ।
        अनुस्वारः परतरः ।
        अर्धेन्दुलसितम् ।
        तारेण ऋद्धम् ।
        एतत्तव मनुस्वरूपम् ॥७॥

        गकारः पूर्वरूपम् ।
        अकारो मध्यरूपम् ।
        अनुस्वारश्चान्त्यरूपम् ।
        बिन्दुरुत्तररूपम् ।
        नादस्संधानम् ।
        सग्ं‌हिता संधिः ॥८॥
        
        सैषा गणेशविद्या ।
        गणक ऋषिः ।
        निचृद्गायत्रीच्छन्दः ।
        गणपतिर्देवता ।
        ॐ गं गणपतये नमः ॥९॥

        एकदन्ताय विद्महे वक्रतुण्डाय धीमहि ।
        तन्नो दन्तिः प्रचोदयात् ॥१०॥

        एकदन्तं चतुर्हस्तं पाशमङ्कुशधारिणम् ।
        रदं च वरदं हस्तैर्बिभ्राणं मूषकध्वजम् ॥
        रक्तं लम्बोदरं शूर्पकर्णकं रक्तवाससम् ।
        रक्तगन्धानुलिप्ताङ्गं रक्तपुष्पैस्सुपूजितम् ॥

        भक्तानुकम्पिनं देवं जगत्कारणमच्युतम् ।
        आविर्भूतं च सृष्ट्यादौ प्रकृतेः पुरुषात्परम् ।
        एवं ध्यायति यो नित्यं स योगी योगिनां वरः ॥११॥

        नमो व्रातपतये ।
        नमो गणपतये ।
        नमः प्रमथपतये ।
        नमस्तेऽस्तु लम्बोदरायैकदन्ताय
        विघ्ननाशिने शिवसुताय वरदमूर्तये नमः ॥१२॥

        एतदथर्वशीर्षं योऽधीते स ब्रह्मभूयाय कल्पते ।
        स सर्वविघ्नैर्न बाध्यते ।
        स सर्वत्र सुखमेधते ।
        स पञ्चमहापापात्प्रमुच्यते ।

        सायमधीयानो दिवसकृतं पापं नाशयति ।
        प्रातरधीयानो रात्रिकृतं पापं नाशयति ।
        सायं प्रातः प्रयुञ्जानो पापोऽपापो भवति ।
        सर्वत्राधीयानोऽपविघ्नो भवति ।
        धर्मार्थकाममोक्षं च विन्दति ॥१३॥

        इदमथर्वशीर्षमशिष्याय न देयम् ।
        यो यदि मोहाद्दास्यति स पापीयान् भवति ।
        सहस्रावर्तनाद्यं यं काममधीते तं तमनेन साधयेत् ॥१४॥

        अनेन गणपतिमभिषिञ्चति स वाग्मी भवति ।
        चतुर्थ्यामनश्नन् जपति स विद्यावान् भवति ।
        इत्यथर्वणवाक्यम् ।
        ब्रह्माद्यावरणं विद्यान्न बिभेति कदाचनेति ॥१५॥

        यो दूर्वाङ्कुरैर्यजति स वैश्रवणोपमो भवति ।
        यो लाजैर्यजति स यशोवान् भवति ।
        स मेधावान् भवति ।
        यो मोदकसहस्रेण यजति स वाञ्छितफलमवाप्नोति ।
        यस्साज्यसमिद्भिर्यजति स सर्वं लभते स सर्वं लभते ॥१६॥

        अष्टौ ब्राह्मणान् सम्यग् ग्राहयित्वा सूर्यवर्चस्वी भवति ।
        सूर्यग्रहेमहानद्यां प्रतिमासन्निधौ वा जप्त्वा सिद्धमन्त्रो भवति
        महाविघ्नात् प्रमुच्यते ।
        महादोषात् प्रमुच्यते ।
        महाप्रत्यवायात् प्रमुच्यते ।
        स सर्वविद् भवति स सर्वविद् भवति ।
        य एवं वेद ।
        इत्युपनिषत् ॥१७॥
        ॐ शान्तिश्शान्तिश्शान्तिः ॥
      `
    };

    setMantra(devotionalDetailsData[devotionalName]);
  }, [devotionalName]);
  const renderParagraphs = (text: string) => {
    const paragraphs = text.split('\n');
    return paragraphs.map((paragraph, index) => {
      const isFirstLine = index === 0;
      return (
        <p key={index} style={{ fontWeight: isFirstLine ? 'bold' : 'normal', fontSize: isFirstLine ? '1.6em' : 'inherit' }}>
          {paragraph}
        </p>
      );
    });
  };
  

  return (
    <IonPage>
        <Header title={"RBook"} /> {/* devotionalName */}
        <IonContent>
            {mantra ? (
            <IonList className="ion-text-center">
                {renderParagraphs(mantra)}
            </IonList>
            ) : (
            <div>Loading...</div>
            )}
        </IonContent>
    </IonPage>
  );
};

export default Details;
