import React, { useEffect, useState } from 'react';
import { IonContent, IonHeader, IonItem, IonList, IonMenuButton, IonPage, IonToolbar } from '@ionic/react';
import { useParams } from 'react-router';
import Header from '../components/Header';

type DevotionalDetails = {
  [key: string]: string;
};

const Details: React.FC = () => {
  const { devotionalName } = useParams<{ devotionalName: string }>();
  const [mantra, setMantra] = useState<string | null>(null);
  
  useEffect(() => {
    const devotionalDetailsData: DevotionalDetails = {
      'Hanuman Chalisa': `\
        दोहा
        श्रीगुरु चरन सरोज रज, निज मनु मुकुरु सुधारि।
        बरनऊं रघुबर बिमल जसु, जो दायकु फल चारि।।
    
        बुद्धिहीन तनु जानिके, सुमिरौं पवन-कुमार।
        बल बुधि विद्या देहु मोहिं, हरहु कलेस विकार।।

        ------------------------------------------------------------
    
        जय हनुमान ज्ञान गुन सागर ।
        जय कपीस तिहुँ लोक उजागर ।। १ ।।

        राम दूत अतुलित बल धामा ।
        अंजनि-पुत्र पवनसुत नामा ।। २ ।।
        
        महाबीर बिक्रम बजरंगी ।
        कुमति निवार सुमति के संगी ।। ३ ।।
        
        कंचन बरन बिराज सुबेसा ।
        कानन कुंडल कुंचति केसा ।। ४ ।।
        
        हाथ बज्र औ ध्वजा बिराजै ।
        काँधे मूँज जनेऊ साजै ।। ५ ।।
        
        संकर सुवन केसरीनंदन ।
        तेज प्रताप महा जग बंदन ।। ६ ।।
        
        बिद्यावान गुनी अति चातुर ।
        राम काज करिबे को आतुर ।। ७ ।।
        
        प्रभु चरित्र सुनिबे को रसिया ।
        राम लखन सीता मन बसिया ।। ८ ।।
        
        सूक्ष्म रूप धरि सियहिं दिखावा ।
        बिकट रूप धरि लंक जरावा ।। ९ ।।
        
        भीम रूप धरि असुर सँहारे ।
        रामचंद्र के काज सँवारे ।। १० ।।
        
        लाय सजीवन लखन जियाये ।
        श्रीरघुबीर हरषि उर लाये ।। ११ ।।
        
        रघुपति कीन्ही बहुत बडाई ।
        तुम मम प्रिय भरतहि सम भाई ।। १२ ।।
        
        सहस बदन तुम्हरो जस गावैं ।
        अस कहि श्रीपति कंठ लगावैं ।। १३ ।।
        
        सनकादिक ब्रह्मादि मुनीसा ।
        नारद सारद सहित अहीसा ।। १४ ।।
        
        जम कुबेर दिगपाल जहाँ ते ।
        कबि कोबिद कहि सके कहाँ ते ।। १५ ।।
        
        तुम उपकार सुग्रीवहिं कीन्हा ।
        राम मिलाय राज पद दीन्हा ।। १६ ।।
        
        तुम्हरो मन्त्र बिभीषन माना ।
        लंकेस्वर भए सब जग जाना ।। १७ ।।
        
        जुग सहस्र जोजन पर भानू ।
        लील्यो ताहि मधुर फल जानू ।। १८ ।।
        
        प्रभु मुद्रिका मेलि मुख माहीं ।
        जलधि लांघि गये अचरज नाहीं ।। १९ ।।
        
        दुर्गम काज जगत के जेते ।
        सुगम अनुग्रह तुम्हरे तेते ।। २० ।।
        
        राम दुआरे तुम रखवारे ।
        होत न आज्ञा बिनु पैसारे ।। २१ ।।
        
        सब सुख लहै तुम्हारी सरना ।
        तुम रच्छक काहू को डर ना ।। २२ ।।
        
        आपन तेज सम्हारो आपै ।
        तीनों लोक हाँक ते काँपै ।। २३ ।।
        
        भूत पिसाच निकट नहिं आवै ।
        महाबीर जब नाम सुनावै ।। २४ ।।
        
        नासै रोग हरै सब पीरा ।
        जपत निरंतर हनुमत बीरा ।। २५ ।।
        
        संकट तें हनुमान छुडावै ।
        मन क्रम बचन ध्यान जो लावै ।। २६ ।।
        
        सब पर राम तपस्वी राजा ।
        तिन के काज सकल तुम साजा ।। २७ ।।
        
        और मनोरथ जो कोइ लावै ।
        सोइ अमित जीवन फल पावै ।। २८ ।।
        
        चारों जुग परताप तुम्हारा ।
        है परसिद्ध जगत उजियारा ।। २९ ।।
        
        साधु संत के तुम रखवारे ।
        असुर निकंदन राम दुलारे ।। ३० ।।
        
        अष्ट सिद्धि नौ निधि के दाता ।
        अस बर दीन जानकी माता ।। ३१ ।।
        
        राम रसायन तुम्हरे पासा ।
        सदा रहो रघुपति के दासा ।। ३२ ।।
        
        तुम्हरे भजन राम को पावै ।
        जनम जनम के दुख बिसरावै ।। ३३ ।।
        
        अंत काल रघुबर पुर जाई ।
        जहाँ जन्म हरि-भक्त कहाई ।। ३४ ।।
        
        और देवता चित्त न धरई ।
        हनुमत सेइ सर्ब सुख करई ।। ३५ ।।
        
        संकट कटै मिटै सब पीरा ।
        जो सुमिरै हनुमत बलबीरा ।। ३६ ।।
        
        जै जै जै हनुमान गोसाई ।
        कृपा करहु गुरु देव की नाई ।। ३७ ।।
        
        जो सत बार पाठ कर कोई ।
        छूटहि बंदि महा सुख होई ।। ३८ ।।
        
        जो यह पढै हनुमानचालीसा ।
        होय सिद्धि साखी गौरीसा ।। ३९ ।।
        
        तुलसीदास सदा हरि चेरा ।
        कीजै नाथ हृदय महँ डेरा ।। ४० ।।
        
        ------------------------------------------------------------
        दोहा
    
        पवन तनय संकट हरण, मंगल मूरति रूप।
        राम लखन सीता सहित, हृदय बसहुरूप।।
      `,
      'Gayatri Mantra': `\
        ॐ भूर् भुवः स्वः |
        तत् सवितुर्वरेण्यं  |
        भर्गो देवस्य धीमहि |
        धियो यो नः प्रचोदयात् ||
      `,
      'Shri Ramrksha stotra': `\
      
      `,
      'Maruti stotra': `\
        भीमरूपी महारुद्रा,
        वज्र हनुमान मारुती ।
        वनारी अंजनीसूता,
        रामदूता प्रभंजना ।।१।।

        महाबळी प्राणदाता,
        सकळां उठवीं बळें ।
        सौख्यकारी शोकहर्ता (१),
        धूर्त वैष्णव गायका ।।२।।

        दिनानाथा हरीरूपा,
        सुंदरा जगदंतरा ।
        पाताळदेवताहंता,
        भव्य सिंदूरलेपना ।।३।।

        लोकनाथा जगन्नाथा,
        प्राणनाथा पुरातना ।
        पुण्यवंता पुण्यशीला,
        पावना परतोषका ।।४।।

        ध्वजांगे उचली बाहू,
        आवेशें लोटिला पुढें ।
        काळाग्नी काळरुद्राग्नी,
        देखतां कांपती भयें ।।५।।

        ब्रह्मांड माईला (२) नेणों,
        आवळें दंतपंगती ।
        नेत्राग्नी चालिल्या ज्वाळा,
        भृकुटी त्राहिटिल्या बळें ।।६।।

        पुच्छ तें मुरडिलें माथां,
        किरीटी कुंडलें बरीं ।
        सुवर्णकटीकासोटी,
        घंटा किंकिणी नागरा ।।७।।

        ठकारे पर्वताऐसा,
        नेटका सडपातळू ।
        चपळांग पाहतां मोठें,
        महाविद्युल्लतेपरी ।।८।।

        कोटिच्या कोटि उड्डाणें,
        झेपावे उत्तरेकडे ।
        मंद्राद्रीसारिखा द्रोणू,
        क्रोधे उत्पाटिला बळें ।।९।।

        आणिता मागुता नेला,
        गेला आला मनोगती । (३)
        मनासी टाकिलें मागें,
        गतीस (४) तूळणा नसे ।।१०।।

        अणूपासोनि ब्रह्मांडा,
        येवढा होत जातसे ।
        तयासी तुळणा कोठें,
        मेरुमंदार धाकुटें ।।११।।

        ब्रह्मांडाभोंवते वेढे,
        वज्रपुच्छ घालूं (५) शके ।
        तयासि तूळणा कैचीं,
        ब्रह्मांडीं पाहतां नसे ।।१२।।

        आरक्त देखिलें डोळां,
        गिळीलें (६) सूर्यमंडळा ।
        वाढतां वाढतां वाढे,
        भेदिलें शून्यमंडळा ।।१३।।

        धनधान्यपशुवृद्धी,
        पुत्रपौत्र समग्रही ।
        पावती रूपविद्यादी,
        स्तोत्र पाठें करूनियां ।।१४।।

        भूतप्रेतसमंधादी,
        रोगव्याधी समस्तही ।
        नासती तूटती चिंता,
        आनंदें भीमदर्शनें ।।१५।।

        हे धरा पंधराश्लोकी,
        लाभली शोभली बरी।
        दृढदेहो निसंदेहो,
        संख्या चंद्रकळागुणें ।।१६।।

        रामदासी अग्रगण्यू,
        कपिकुळासी मंडण (७) ।
        रामरूपी अंतरात्मा,
        दर्शनें दोष नासती ।।१७।।

        ।। इति श्रीरामदासकृतं संकटनिरसनं
        मारुतिस्तोत्रं संपूर्णम् ।।
        ।। श्रीसीतारामचंद्रार्पणमस्तु ।।
      `,
      'Madhurashtakam': `\
        अधरं मधुरं वदनं मधुरं नयनं मधुरं हसितं मधुरम् ।
        हृदयं मधुरं गमनं मधुरं मधुराधिपतेरखिलं मधुरम् ॥ १ ॥
        
        वचनं मधुरं चरितं मधुरं वसनं मधुरं वलितं मधुरम् ।
        चलितं मधुरं भ्रमितं मधुरं मधुराधिपतेरखिलं मधुरम् ॥ २ ॥
        
        वेणुर्मधुरो रेणुर्मधुरः पाणिर्मधुरः पादौ मधुरौ ।
        नृत्यं मधुरं सख्यं मधुरं मधुराधिपतेरखिलं मधुरम् ॥ ३ ॥
        
        गीतं मधुरं पीतं मधुरं भुक्तं मधुरं सुप्तं मधुरम् ।
        रूपं मधुरं तिलकं मधुरं मधुराधिपतेरखिलं मधुरम् ॥ ४ ॥

        करणं मधुरं तरणं मधुरं हरणं मधुरं स्मरणं मधुरम् ।
        वमितं मधुरं शमितं मधुरं मधुराधिपतेरखिलं मधुरम् ॥ ५ ॥

        गुञ्जा मधुरा माला मधुरा यमुना मधुरा वीची मधुरा ।
        सलिलं मधुरं कमलं मधुरं मधुराधिपतेरखिलं मधुरम् ॥ ६ ॥

        गोपी मधुरा लीला मधुरा युक्तं मधुरं मुक्तं मधुरम् ।
        दृष्टं मधुरं शिष्टं मधुरं मधुराधिपतेरखिलं मधुरम् ॥ ७ ॥

        गोपा मधुरा गावो मधुरा यष्टिर्मधुरा सृष्टिर्मधुरा ।
        दलितं मधुरं फलितं मधुरं मधुराधिपतेरखिलं मधुरम् ॥ ८ ॥
      `,
      'Shri Ram Stuti': `\
        श्री रामचन्द्र कृपालु भजुमन हरणभवभयदारुणं
        नवकंज लोचन कंज मुखकर, कंज पद कन्जारुणम्
        कन्दर्प अगणित अमित छवि नवनील नीरद सुन्दरं
        पटपीत मानहु तडित रूचिशुचि नौमिजनकसुतावरं
        भजुदीनबन्धु दिनेश दानव दैत्यवंशनिकन्दनं
        रघुनन्द आनन्दकन्द कोशलचन्द्र दशरथनन्दनं
        सिरमुकुटकुण्डल तिलकचारू उदारु अंगविभूषणं
        आजानुभुज शरचापधर संग्रामजित खरदूषणं
        इति वदति तुलसीदास शङकरशेषमुनिमनरंजनं
        ममहृदयकंजनिवासकुरु कामादि खलदल गञजनं
        मनु जाहि राचेउ मिलिहि सो बरु सहज सुन्दर सावरो
        करुना निधान सुजान सीलु सनेहु जानत रावरो
        एही भाँति गौरी असीस सुनी सिय सहित हिय हरषींअली
        तुलसी भवानी पूजी पुनि-पुनि मुदित मन मन्दिर चली
        मुदित मन मंदिर चली
        
        ------------------------------------------------------------
        सोरठा

        जानी गौरी अनुकूल सिय हिय हरषु न जाइ कहि
        मंजुल मंगल मूल बाम अंग फरकन लगे
      `,
      'Bajrang Baan': `\
        दोहा
        "निश्चय प्रेम प्रतीति ते, बिनय करैं सनमान।"
        "तेहि के कारज सकल शुभ, सिद्ध करैं हनुमान॥"

        ----------------------------------------------------------
        
        चोपाई

        जय हनुमन्त सन्त हितकारी। सुन लीजै प्रभु अरज हमारी।।
        जन के काज विलम्ब न कीजै। आतुर दौरि महासुख दीजै।।
        जैसे कूदि सिन्धु महि पारा। सुरसा बदन पैठि विस्तारा।।
        आगे जाई लंकिनी रोका। मारेहु लात गई सुर लोका।।
        जाय विभीषण को सुख दीन्हा। सीता निरखि परमपद लीन्हा।।
        बाग उजारि सिन्धु महँ बोरा। अति आतुर जमकातर तोरा।।
        अक्षयकुमार को मारि संहारा। लूम लपेट लंक को जारा।।
        लाह समान लंक जरि गई। जय जय धुनि सुरपुर में भई।।
        अब विलम्ब केहि कारण स्वामी। कृपा करहु उर अन्तर्यामी।।
        जय जय लक्ष्मण प्राण के दाता। आतुर होय दुख हरहु निपाता।।
        जै गिरिधर जै जै सुखसागर। सुर समूह समरथ भटनागर।।
        ॐ हनु हनु हनुमंत हठीले। बैरिहिं मारु बज्र की कीले।।
        गदा बज्र लै बैरिहिं मारो। महाराज प्रभु दास उबारो।।
        ऊँकार हुंकार प्रभु धावो। बज्र गदा हनु विलम्ब न लावो।।
        ॐ ह्रीं ह्रीं ह्रीं हनुमंत कपीसा। ऊँ हुं हुं हुं हनु अरि उर शीशा।।
        सत्य होहु हरि शपथ पाय के। रामदूत धरु मारु जाय के।।
        जय जय जय हनुमन्त अगाधा। दुःख पावत जन केहि अपराधा।।
        पूजा जप तप नेम अचारा। नहिं जानत हौं दास तुम्हारा।।
        वन उपवन, मग गिरिगृह माहीं। तुम्हरे बल हम डरपत नाहीं।।
        पांय परों कर ज़ोरि मनावौं। यहि अवसर अब केहि गोहरावौं।।
        जय अंजनिकुमार बलवन्ता। शंकरसुवन वीर हनुमन्ता।।
        बदन कराल काल कुल घालक। राम सहाय सदा प्रतिपालक।।
        भूत प्रेत पिशाच निशाचर। अग्नि बेताल काल मारी मर।।
        इन्हें मारु तोहिं शपथ राम की। राखु नाथ मरजाद नाम की।।
        जनकसुता हरिदास कहावौ। ताकी शपथ विलम्ब न लावो।।
        जय जय जय धुनि होत अकाशा। सुमिरत होत दुसह दुःख नाशा।।
        चरण शरण कर ज़ोरि मनावौ। यहि अवसर अब केहि गोहरावौं।।
        उठु उठु चलु तोहि राम दुहाई। पांय परों कर ज़ोरि मनाई।।
        ॐ चं चं चं चं चपत चलंता। ऊँ हनु हनु हनु हनु हनुमन्ता।।
        ऊँ हँ हँ हांक देत कपि चंचल। ऊँ सं सं सहमि पराने खल दल।।
        अपने जन को तुरत उबारो। सुमिरत होय आनन्द हमारो।।
        यह बजरंग बाण जेहि मारै। ताहि कहो फिर कौन उबारै।।
        पाठ करै बजरंग बाण की। हनुमत रक्षा करै प्राण की।।
        यह बजरंग बाण जो जापै। ताते भूत प्रेत सब काँपै।।
        धूप देय अरु जपै हमेशा। ताके तन नहिं रहै कलेशा।।

        ----------------------------------------------

        दोहा

        " प्रेम प्रतीतहि कपि भजै, सदा धरैं उर ध्यान। "
        " तेहि के कारज सकल शुभ, सिद्घ करैं हनुमान।। "
      `,
      'Hanuman Ji Aarti': `\
        आरती कीजै हनुमान लला की
        आरती कीजै हनुमान लला की
        दुष्ट डलन रघुनाथ कला की
        (आरती कीजै हनुमान लला की)
        (आरती कीजै हनुमान लला की)
        जाके बल से गिरिवर कांपे
        रोग दोष जाके निकट न झांपे
        अनजनी पुत्र महाबलदायी
        संथन के प्रभु सदा सुहाई
        (आरती कीजै हनुमान लला की)
        (आरती कीजै हनुमान लला की)
        दे बीरा रघुनाथ पठाए
        लंका जारी सिया सुध लाए
        (लंका सो कोट समुद्र सी खाई)
        (जात पवनसुत बार न लाई)
        लंका जारी असुरसंगारे
        सियारामजी के काज संवारे
        लक्ष्मण मूर्छित पड़े सकारे
        आणि सजीवन प्राण उबारे
        (पैठी पताल तोरि जम कारे)
        (अहिरावण की भुजा उखाड़े)
        बाएं भुजा असुरदल मारे
        दाहिने भुजा संतजन तारे
        सुर-नर-मुनि आरती उतारे
        जै जै जै हनुमान उचारे
        जो हनुमान की आरती गावै
        बसी बैकुंठ परमपद पावै
        (आरती कीजै हनुमान लला की)
        (आरती कीजै हनुमान लला की)
        (आरती कीजै हनुमान लला की)
        (आरती कीजै हनुमान लला की)
      `,
    };

    setMantra(devotionalDetailsData[devotionalName]);
  }, [devotionalName]);
  const renderParagraphs = (text: string) => {
    return text.split('\n').map((paragraph, index) => (
      <p key={index}>{paragraph}</p>
    ));
  };

  return (
    <IonPage>
        <Header title={devotionalName} />
        <IonContent>
            {mantra ? (
            <IonList className="ion-text-center">
                {renderParagraphs(mantra)}
            </IonList>
            ) : (
            <div>Loading...</div>
            )}
        </IonContent>
    </IonPage>
  );
};

export default Details;
